## I connected my mysql database to jupyter notebook

### I first installed the following

In [6]:
!pip install ipython-sql
!pip install mysqlclient
!pip install pymysql

Collecting ipython-sql
  Downloading ipython_sql-0.4.1-py3-none-any.whl (21 kB)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.4.22)
Collecting sqlparse
  Downloading sqlparse-0.4.2-py3-none-any.whl (42 kB)
Requirement already satisfied: ipython>=1.0 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
Requirement already satisfied: six in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: pickleshare in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: traitlets>=4.2 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: decorator in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: backcall in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: setuptools>=18.5 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: pygments in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: colorama in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\programdata\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13714 sha256=b49b311fa5ad7c240bb084e42416ef63be547e4bde587398fd0733f592ce507e
  Stored in directory: c:\users\user\appdata\local\pip\cache\wheels\75\f7\28\77a076f1fa8cbeda61aca712815d04d7a32435f04a26a2dd7b
Successfully built prettytable
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.1 prettytable-0.7.2 sqlparse-0.4.2
Collecting mysqlclient
  Downloading mysqlclient-2.1.1-cp39-cp39-win_amd64.whl (178 kB)
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.1.1
Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

### Next, Import sql and load it
### load mysql as shown below
### You can replace it with any other sql database like postgresql e.t.c.

In [2]:
import sql
from sqlalchemy import create_engine


# %load_ext sql
# %sql mysql://username:password@hostname/dbname

%sql mysql://Bamise:*********@localhost/dannys_diner #I edited out my password

#### To use sql in your working environment, you have to use

#### %%sql  as the first line of code

#### Now, after loading our file into our working environment, let's look at each of our tables

In [3]:
%%sql

select * 
from sales;

 * mysql://Bamise:***@localhost/dannys_diner
15 rows affected.

[('A', datetime.date(2021, 1, 1), 1),
 ('A', datetime.date(2021, 1, 1), 2),
 ('A', datetime.date(2021, 1, 7), 2),
 ('A', datetime.date(2021, 1, 10), 3),
 ('A', datetime.date(2021, 1, 11), 3),
 ('A', datetime.date(2021, 1, 11), 3),
 ('B', datetime.date(2021, 1, 1), 2),
 ('B', datetime.date(2021, 1, 2), 2),
 ('B', datetime.date(2021, 1, 4), 1),
 ('B', datetime.date(2021, 1, 11), 1),
 ('B', datetime.date(2021, 1, 16), 3),
 ('B', datetime.date(2021, 2, 1), 3),
 ('C', datetime.date(2021, 1, 1), 3),
 ('C', datetime.date(2021, 1, 1), 3),
 ('C', datetime.date(2021, 1, 7), 3)]

In [5]:
%%sql

select * 
from menu;

 * mysql://Bamise:***@localhost/dannys_diner
3 rows affected.

[(1, 'sushi', 10), (2, 'curry', 15), (3, 'ramen', 12)]

In [6]:
%%sql

select * 
from members;

 * mysql://Bamise:***@localhost/dannys_diner
2 rows affected.

[('A', datetime.date(2021, 1, 7)), ('B', datetime.date(2021, 1, 9))]

## SOLUTIONS

#### 1. What is the total amount each customer spent at the restaurant?

To solve this: we need the tables that have information on price and product_id as well as customer_id. But the price information is in the menu table while the customer_id is on the sales table. So we have to join both sales and menu table on what is common to both - the product_id. Since we need the total amount spent, we sum the price for all the purchases they made as shown below. Then we can group by the customer_id. You can decide to use sales as s or sales s in your query, both works. When joining you can simply use 'using'. e.g. from sales join menu using product_id. Also works. But to avoid ambigiuity, you can use the method below.

In [7]:
%%sql

select customer_id, sum(price) as total_sales
from sales s
join menu m on s.product_id = m.product_id
group by customer_id;

 * mysql://Bamise:***@localhost/dannys_diner
3 rows affected.

[('A', Decimal('76')), ('B', Decimal('74')), ('C', Decimal('36'))]

#### 2. How many days has each customer visited the restaurant?

To solve this: we need to count the number of times each customer visited, which is obtained by looking at the order_date entry to know the number of times they came and it's possible that they might make more than one order on the same day, so we use distinct to only account for one visit irrespective of the number of purchases made that day.

In [9]:
%%sql

select customer_id, count(distinct order_date) as no_of_visits
from sales
group by customer_id;

 * mysql://Bamise:***@localhost/dannys_diner
3 rows affected.

[('A', 4), ('B', 6), ('C', 2)]

#### 3. What was the first item from the menu purchased by each customer?

To solve this: The word 'first' here means it has to follow an order. 

You want to rank the items bought by each customer according to the order dates. 

Hence you will consider the window function for ranking. 

Dense_rank() over (partition by each customer and order by order date) as ranks. 

You will need what we call a CTE- common table expression to create a sub-table where you can perform your ranking and then select from it.

Now after ranking we will select the customer_id with ranks = 1

In [12]:
%%sql

WITH ordered_sales_cte AS
(SELECT s.customer_id, s.order_date, product_name, 
 DENSE_RANK() OVER (PARTITION BY s.customer_id 
                    ORDER BY s.order_date) AS ranks
FROM sales AS s
 JOIN menu AS m
 ON s.product_id = m.product_id)

SELECT customer_id, product_name, ranks
FROM ordered_sales_cte
WHERE ranks = 1
GROUP BY customer_id, product_name;

 * mysql://Bamise:***@localhost/dannys_diner
4 rows affected.

[('A', 'sushi', 1), ('A', 'curry', 1), ('B', 'curry', 1), ('C', 'ramen', 1)]

#### 4. What is the most purchased item on the menu and how many times was it purchased by all customers?

To solve this: We need to count the products to know the number of purchases. We can then order by the purchase count in descending order so that the we go from the highest to the lowest and then limit 1 to see only the highest.

In [14]:
%%sql

select s.product_id, product_name, count(s.product_id) as purchase_count 
from sales s
join menu m on s.product_id = m.product_id
group by s.product_id
order by purchase_count desc
limit 1;

 * mysql://Bamise:***@localhost/dannys_diner
1 rows affected.

[(3, 'ramen', 8)]

#### 5. Which item was the most popular for each customer?

To solve this: We want to know how many times each customer purchased each item then we rank each item according to the number of times the customer made the purchase.

In [15]:
%%sql


WITH most_popular_item_cte AS
(SELECT s.customer_id, m.product_name, 
  COUNT(m.product_id) AS times_purchased,
  DENSE_RANK() OVER(PARTITION BY s.customer_id
  ORDER BY COUNT(s.customer_id) DESC) AS ranks
FROM menu AS m
JOIN sales AS s
 ON m.product_id = s.product_id
GROUP BY s.customer_id, m.product_id, product_name)
SELECT * FROM most_popular_item_cte
WHERE ranks = 1;

 * mysql://Bamise:***@localhost/dannys_diner
5 rows affected.

[('A', 'ramen', 3, 1),
 ('B', 'curry', 2, 1),
 ('B', 'sushi', 2, 1),
 ('B', 'ramen', 2, 1),
 ('C', 'ramen', 3, 1)]

#### 6. Which item was purchased first by the customer after they became a member?

To solve this: To do this, I tried two approaches.
1. I filtered for the purchases made on/after the join_date and ordered by asc to begin from the oldest (first) purchase.

2. I used a CTE- to first filter for the purchases made on/after the join date, then ranked the purchases using the window function dense_rank and then selected all ranks = 1.

In [16]:
%%sql

# 1.

select s.customer_id, s.order_date, mb.join_date, s.product_id, m.product_name 
from sales s
join members mb on s.customer_id = mb.customer_id
join menu m on s.product_id = m.product_id
where order_date >= join_date 
group by s.customer_id
order by s.customer_id asc;

 * mysql://Bamise:***@localhost/dannys_diner
2 rows affected.

[('A', datetime.date(2021, 1, 7), datetime.date(2021, 1, 7), 2, 'curry'),
 ('B', datetime.date(2021, 1, 11), datetime.date(2021, 1, 9), 1, 'sushi')]

In [17]:
%%sql

# 2.We can also achieve this using a CTE and a window dense_rank()function

WITH member_sales_cte AS 
(SELECT s.customer_id, m.join_date, s.order_date, s.product_id,
         DENSE_RANK() OVER(PARTITION BY s.customer_id
  ORDER BY s.order_date) AS ranks
     FROM sales AS s
 JOIN members AS m
  ON s.customer_id = m.customer_id
 WHERE s.order_date >= m.join_date)
SELECT s.customer_id,s.order_date, m.product_name 
FROM member_sales_cte AS s
JOIN menu as m
on s.product_id = m.product_id
where s.ranks = 1
order by s.customer_id;

 * mysql://Bamise:***@localhost/dannys_diner
2 rows affected.

[('A', datetime.date(2021, 1, 7), 'curry'),
 ('B', datetime.date(2021, 1, 11), 'sushi')]

#### 7. Which item was purchased just before the customer became a member?

To solve this:

This is a reversal of number 6. All you have to do is to filter for orders made before they joined then rank it in order of descending to get the last purchase as shown below.

In [18]:
%%sql

WITH member_sales_cte AS 
(SELECT s.customer_id, m.join_date, s.order_date, s.product_id,
         DENSE_RANK() OVER(PARTITION BY s.customer_id
  ORDER BY s.order_date desc) AS ranks
     FROM sales AS s
 JOIN members AS m
  ON s.customer_id = m.customer_id
 WHERE s.order_date < m.join_date)
SELECT s.customer_id,s.order_date, m.product_name 
FROM member_sales_cte AS s
JOIN menu as m
on s.product_id = m.product_id
where s.ranks = 1
order by s.customer_id;

 * mysql://Bamise:***@localhost/dannys_diner
3 rows affected.

[('A', datetime.date(2021, 1, 1), 'sushi'),
 ('A', datetime.date(2021, 1, 1), 'curry'),
 ('B', datetime.date(2021, 1, 4), 'sushi')]

#### -- 8. What is the total items and amount spent for each member before they became a member?

 -- NOTE- we are dealing with unique items not total number of purchases.
 
 -- we can use two approaches 
 
 1. Using CTE to first select items bought before they came a member then we can now select from the cte the distinct products and match it up with the price 
 
 2.We can use a simpler query

In [23]:
%%sql

# 1. 

WITH member_sales_cte AS 
(SELECT s.customer_id, m.join_date, s.order_date, s.product_id
     FROM sales AS s
 JOIN members AS m
  ON s.customer_id = m.customer_id
 WHERE s.order_date < m.join_date)
SELECT s.customer_id,s.order_date, sum(m.price), count(distinct s.product_id) as menu_item
FROM member_sales_cte AS s
JOIN menu as m
on s.product_id = m.product_id
group by s.customer_id
order by s.customer_id;

 * mysql://Bamise:***@localhost/dannys_diner
2 rows affected.

[('A', datetime.date(2021, 1, 1), Decimal('25'), 2),
 ('B', datetime.date(2021, 1, 4), Decimal('40'), 2)]

In [24]:
%%sql

# -- Approach 2


SELECT s.customer_id, sum(m.price) as total_spent, count(distinct s.product_id) as menu_item
FROM sales AS s
JOIN menu as m on s.product_id = m.product_id
join members as mb on s.customer_id = mb.customer_id
where s.order_date < mb.join_date
group by s.customer_id
order by s.customer_id;

 * mysql://Bamise:***@localhost/dannys_diner
2 rows affected.

[('A', Decimal('25'), 2), ('B', Decimal('40'), 2)]

In [ ]:
#### -- 9.  If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

To solve this: We would emplpy a case statement with our CTE. We can either use when product_name = sushi or when product_id = 1 because they represent the same thing.

In [ ]:
%%sql

WITH points_cte AS
(SELECT m.product_id, m.product_name, 
CASE WHEN m.product_name = 'sushi' THEN m.price*20 
ELSE price*10 END AS points
from menu m)
SELECT customer_id,SUM(p.points) AS total_points
FROM points_cte p 
JOIN sales s
on p.product_id = s.product_id
GROUP BY s.customer_id;

#### -- 10. In the first week after a customer joins the program 
#### -- (including their join date) they earn 2x points on all items, not just sushi 
#### -- - how many points do customer A and B have at the end of January?

To solve this:
We need a simplified approach.
We need to determine the first week after the customer joins and to obtain that we only need to add 6 days to the join date and then we can store that as the valid date.
Then to know the end of january, we need to look at the date-time functions and it varies from database to database. Microsoft sql will use EOMONTH while Mysql simply uses last day. So you might have to go through your documentation to know what will work for you.
After that, we can now apply or case statement to fulfil the criteria we need. Again you can use product_id = 1 inplace of product_name = 'sushi

In [26]:
%%sql


WITH dates_cte AS 
(
 SELECT *,
  DATE_ADD(join_date, INTERVAL 6 DAY) AS valid_date, 
  LAST_DAY('2021-01-31') AS last_date
 FROM members AS m
)
SELECT d.customer_id, s.order_date, d.join_date, 
 d.valid_date, d.last_date, m.product_name, m.price,
 SUM(CASE
  WHEN m.product_name = 'sushi' THEN 2 * 10 * m.price
  WHEN s.order_date BETWEEN d.join_date AND d.valid_date THEN 2 * 10 * m.price
  ELSE 10 * m.price
  END) AS points
FROM dates_cte AS d
JOIN sales AS s
 ON d.customer_id = s.customer_id
JOIN menu AS m
 ON s.product_id = m.product_id
WHERE s.order_date < d.last_date
GROUP BY d.customer_id
ORDER BY d.customer_id asc;

 * mysql://Bamise:***@localhost/dannys_diner
2 rows affected.

[('A', datetime.date(2021, 1, 1), datetime.date(2021, 1, 7), datetime.date(2021, 1, 13), datetime.date(2021, 1, 31), 'sushi', 10, Decimal('1370')),
 ('B', datetime.date(2021, 1, 11), datetime.date(2021, 1, 9), datetime.date(2021, 1, 15), datetime.date(2021, 1, 31), 'sushi', 10, Decimal('820'))]

#### Now you have come to the end of the answers. I will add the bonus questions in a future post.

I had help from some other resources you can also check here

1. https://medium.com/analytics-vidhya/8-week-sql-challenge-case-study-week-1-dannys-diner-2ba026c897ab 
2. https://medium.com/@maisieng.busylearning/danny-mas-8-week-sql-challenge-case-study-1-danny-s-diner-using-sql-and-pandas-7749c354f499